; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	image5 - mode
	spectrograph1 - mode
	image4 - mode
	image3 - mode
	spectrograph0 - mode
	infrared2 - mode
	GroundStation0 - direction
	Star1 - direction
	Star4 - direction
	Star2 - direction
	Star3 - direction
	Planet5 - direction
	Star6 - direction
	Phenomenon7 - direction
	Star8 - direction
	Planet9 - direction
)
(:init
	(supports instrument0 image3)
	(supports instrument0 spectrograph1)
	(supports instrument0 spectrograph0)
	(calibration_target instrument0 Star4)
	(supports instrument1 spectrograph1)
	(supports instrument1 image3)
	(supports instrument1 image4)
	(supports instrument1 infrared2)
	(calibration_target instrument1 Star2)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star8)
	(supports instrument2 image3)
	(supports instrument2 spectrograph0)
	(supports instrument2 image5)
	(calibration_target instrument2 Star3)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 GroundStation0)
)
(:goal (and
	(pointing satellite0 Phenomenon7)
	(have_image Planet5 image4)
	(have_image Star6 spectrograph1)
	(have_image Star6 image5)
	(have_image Phenomenon7 infrared2)
	(have_image Phenomenon7 image4)
	(have_image Star8 image3)
	(have_image Planet9 spectrograph1)
	(have_image Planet9 image5)
))

)

; plan
1. (turn_to satellite1 star3 groundstation0)
   deleted: (pointing satellite1 groundstation0)
   added: (pointing satellite1 star3)
   goals met: 0 of 9
2. (switch_on instrument2 satellite1)
   deleted: (power_avail satellite1)
   added: (power_on instrument2)
   goals met: 0 of 9
3. (calibrate satellite1 instrument2 star3)
   added: (calibrated instrument2)
   goals met: 0 of 9
4. (turn_to satellite1 star6 star3)
   deleted: (pointing satellite1 star3)
   added: (pointing satellite1 star6)
   goals met: 0 of 9
5. (take_image satellite1 star6 instrument2 image5)
   added: (have_image star6 image5)
   goals met: 1 of 9
6. (turn_to satellite1 planet9 star6)
   deleted: (pointing satellite1 star6)
   added: (pointing satellite1 planet9)
   goals met: 1 of 9
7. (turn_to satellite0 star2 star8)
   deleted: (pointing satellite0 star8)
   added: (pointing satellite0 star2)
   goals met: 1 of 9
8. (switch_on instrument1 satellite0)
   deleted: (power_avail satellite0)
   added: (power_on instrument1)
   goals met: 1 of 9
9. (calibrate satellite0 instrument1 star2)
   added: (calibrated instrument1)
   goals met: 1 of 9
10. (take_image satellite1 planet9 instrument2 image5)
   added: (have_image planet9 image5)
   goals met: 2 of 9
11. (turn_to satellite0 planet5 star2)
   deleted: (pointing satellite0 star2)
   added: (pointing satellite0 planet5)
   goals met: 2 of 9
12. (take_image satellite0 planet5 instrument1 image4)
   added: (have_image planet5 image4)
   goals met: 3 of 9
13. (turn_to satellite0 planet9 planet5)
   deleted: (pointing satellite0 planet5)
   added: (pointing satellite0 planet9)
   goals met: 3 of 9
14. (take_image satellite0 planet9 instrument1 spectrograph1)
   added: (have_image planet9 spectrograph1)
   goals met: 4 of 9
15. (turn_to satellite0 star6 planet9)
   deleted: (pointing satellite0 planet9)
   added: (pointing satellite0 star6)
   goals met: 4 of 9
16. (take_image satellite0 star6 instrument1 spectrograph1)
   added: (have_image star6 spectrograph1)
   goals met: 5 of 9
17. (turn_to satellite0 phenomenon7 star6)
   deleted: (pointing satellite0 star6)
   added: (pointing satellite0 phenomenon7)
   goals met: 6 of 9
18. (take_image satellite0 phenomenon7 instrument1 image4)
   added: (have_image phenomenon7 image4)
   goals met: 7 of 9
19. (take_image satellite0 phenomenon7 instrument1 infrared2)
   added: (have_image phenomenon7 infrared2)
   goals met: 8 of 9
20. (turn_to satellite1 star8 planet9)
   deleted: (pointing satellite1 planet9)
   added: (pointing satellite1 star8)
   goals met: 8 of 9
21. (take_image satellite1 star8 instrument2 image3)
   added: (have_image star8 image3)
   goals met: 9 of 9
